<?php

namespace App;

use Illuminate\Database\Eloquent\Model;

class Country extends Model
{
    /**
     * @return array
     */
    public function getCountries(){
        return $this->countries;
    }

    private $countries = [

        ["id" => "1875",
            "name"=>"ایران"],

        ["id" => "57",
            "name"=>"آذربايجان"],

        ["id" => "50",
            "name"=>"آرژانتين"],

        ["id" => "131",
            "name"=>"آفريقاي ‌مرکزي"],

        ["id" => "130",
            "name"=>"آفريقاي‌ جنوبي"],

        ["id" => "104",
            "name"=>"آلباني"],

        ["id" => "10",
            "name"=>"آلمان"],

        ["id" => "1000",
            "name"=>"آندورا"],

        ["id" => "30",
            "name"=>"اتريش"],

        ["id" => "124",
            "name"=>"اتيوپي"],

        ["id" => "100",
            "name"=>"اردن"],

        ["id" => "2",
            "name"=>"ارمنستان"],

        ["id" => "206",
            "name"=>"اروگوئه"],

        ["id" => "223",
            "name"=>"اريتره"],

        ["id" => "58",
            "name"=>"ازبکستان"],

        ["id" => "224",
            "name"=>"اسانسيون"],

        ["id" => "9",
            "name"=>"اسپانيا"],

        ["id" => "20",
            "name"=>"استراليا"],

        ["id" => "265",
            "name"=>"استوني"],

        ["id" => "59",
            "name"=>"اسلواکي"],

        ["id" => "266",
            "name"=>"اسلوني"],

        ["id" => "7",
            "name"=>"افغانستان"],

        ["id" => "319",
            "name"=>"الجزاير"],

        ["id" => "133",
            "name"=>"السالوادور"],

        ["id" => "23",
            "name"=>"امارات متحده عربي"],

        ["id" => "6",
            "name"=>"امريکا"],

        ["id" => "60",
            "name"=>"انتيگويا"],

        ["id" => "32",
            "name"=>"اندونزي"],

        ["id" => "16",
            "name"=>"انگلستان"],

        ["id" => "221",
            "name"=>"انگولا"],

        ["id" => "222",
            "name"=>"انگيلا"],

        ["id" => "264",
            "name"=>"اوگاندا"],

        ["id" => "1005",
            "name"=>"اونيون"],

        ["id" => "33",
            "name"=>"ايتاليا"],

        ["id" => "235",
            "name"=>"ايرلند"],

        ["id" => "105",
            "name"=>"ايسلند"],

        ["id" => "103",
            "name"=>"اکراين"],

        ["id" => "132",
            "name"=>"اکوادور"],

        ["id" => "135",
            "name"=>"باربادوس"],

        ["id" => "1001",
            "name"=>"باربد"],

        ["id" => "137",
            "name"=>"باهاما"],

        ["id" => "80",
            "name"=>"بحرين"],

        ["id" => "21",
            "name"=>"برزيل"],

        ["id" => "226",
            "name"=>"برمودا"],

        ["id" => "140",
            "name"=>"برونئي دارالسلام"],

        ["id" => "139",
            "name"=>"بروندي"],

        ["id" => "34",
            "name"=>"بلژيک"],

        ["id" => "227",
            "name"=>"بلغارستان"],

        ["id" => "228",
            "name"=>"بليز"],

        ["id" => "142",
            "name"=>"بنگلادش"],

        ["id" => "136",
            "name"=>"بنين"],

        ["id" => "229",
            "name"=>"بوتان"],

        ["id" => "230",
            "name"=>"بوتسوانا"],

        ["id" => "54",
            "name"=>"بورگينافاسو"],

        ["id" => "8017",
            "name"=>"بوسني و هرزه گوين"],

        ["id" => "141",
            "name"=>"بوليوي"],

        ["id" => "281",
            "name"=>"بيلاروس"],

        ["id" => "208",
            "name"=>"پاراگوئه"],

        ["id" => "149",
            "name"=>"پاناما"],

        ["id" => "24",
            "name"=>"پاکستان"],

        ["id" => "125",
            "name"=>"پرتغال"],

        ["id" => "150",
            "name"=>"پرو"],

        ["id" => "1002",
            "name"=>"پلي نزي"],

        ["id" => "555",
            "name"=>"تاجيکستان"],

        ["id" => "144",
            "name"=>"تانزانيا"],

        ["id" => "52",
            "name"=>"تايلند"],

        ["id" => "17",
            "name"=>"تايوان"],

        ["id" => "233",
            "name"=>"ترينيدادوتوباکو"],

        ["id" => "619",
            "name"=>"ترکمنستان"],

        ["id" => "3",
            "name"=>"ترکيه"],

        ["id" => "147",
            "name"=>"توگون"],

        ["id" => "35",
            "name"=>"تونس"],

        ["id" => "207",
            "name"=>"تونگا"],

        ["id" => "234",
            "name"=>"تووالو"],

        ["id" => "1004",
            "name"=>"تيمور شرقي"],

        ["id" => "151",
            "name"=>"جامائيکا"],

        ["id" => "239",
            "name"=>"جبل الطارق"],

        ["id" => "1003",
            "name"=>"جزاير آنتيل"],

        ["id" => "210",
            "name"=>"جزاير سليمان"],

        ["id" => "155",
            "name"=>"جيبوتي"],

        ["id" => "126",
            "name"=>"چاد"],

        ["id" => "13",
            "name"=>"چين"],

        ["id" => "240",
            "name"=>"چک"],

        ["id" => "36",
            "name"=>"دانمارک"],

        ["id" => "156",
            "name"=>"دومينيک"],

        ["id" => "157",
            "name"=>"دومينيکن"],

        ["id" => "158",
            "name"=>"رواندا"],

        ["id" => "99",
            "name"=>"روسيه"],

        ["id" => "112",
            "name"=>"روماني"],

        ["id" => "242",
            "name"=>"زئير"],

        ["id" => "159",
            "name"=>"زامبيا"],

        ["id" => "243",
            "name"=>"زيمباوه"],

        ["id" => "37",
            "name"=>"ژاپن"],

        ["id" => "1006",
            "name"=>"سائوتمه"],

        ["id" => "246",
            "name"=>"ساحل‌عاج"],

        ["id" => "62",
            "name"=>"سامواي غربي"],

        ["id" => "160",
            "name"=>"سريلانکا"],

        ["id" => "1008",
            "name"=>"سن پروميگو"],

        ["id" => "161",
            "name"=>"سن لوئيس"],

        ["id" => "1007",
            "name"=>"سن نپال"],

        ["id" => "1010",
            "name"=>"سن هلن"],

        ["id" => "1009",
            "name"=>"سن کريستوف"],

        ["id" => "251",
            "name"=>"سنگاپور"],

        ["id" => "163",
            "name"=>"سنگال"],

        ["id" => "38",
            "name"=>"سوئد"],

        ["id" => "39",
            "name"=>"سوئيس"],

        ["id" => "164",
            "name"=>"سوايزيلند"],

        ["id" => "106",
            "name"=>"سودان"],

        ["id" => "165",
            "name"=>"سورينام"],

        ["id" => "25",
            "name"=>"سوريه"],

        ["id" => "176",
            "name"=>"سومالي"],

        ["id" => "167",
            "name"=>"سيرالئون"],

        ["id" => "168",
            "name"=>"سيشل"],

        ["id" => "254",
            "name"=>"شيلي"],

        ["id" => "8018",
            "name"=>"صربستان"],

        ["id" => "107",
            "name"=>"عراق"],

        ["id" => "4",
            "name"=>"عربستان"],

        ["id" => "29",
            "name"=>"عمان"],

        ["id" => "169",
            "name"=>"غنا"],

        ["id" => "109",
            "name"=>"فرانسه"],

        ["id" => "170",
            "name"=>"فنلاند"],

        ["id" => "255",
            "name"=>"فيجي"],

        ["id" => "127",
            "name"=>"فيليپين"],

        ["id" => "26",
            "name"=>"قبرس"],

        ["id" => "63",
            "name"=>"قرقيزستان"],

        ["id" => "64",
            "name"=>"قزاقستان"],

        ["id" => "27",
            "name"=>"قطر"],

        ["id" => "177",
            "name"=>"گابون"],

        ["id" => "178",
            "name"=>"گامبيا"],

        ["id" => "179",
            "name"=>"گرانادا"],

        ["id" => "66",
            "name"=>"گرجستان"],

        ["id" => "180",
            "name"=>"گواتمالا"],

        ["id" => "8012",
            "name"=>"گوادالوپ"],

        ["id" => "182",
            "name"=>"گويان"],

        ["id" => "53",
            "name"=>"گويان‌فرانسه"],

        ["id" => "183",
            "name"=>"گينه"],

        ["id" => "263",
            "name"=>"گينه‌استوايي"],

        ["id" => "184",
            "name"=>"گينه‌بيسائو"],

        ["id" => "185",
            "name"=>"لائوس"],

        ["id" => "101",
            "name"=>"لبنان"],

        ["id" => "67",
            "name"=>"لتوني"],

        ["id" => "187",
            "name"=>"لسوتو"],

        ["id" => "8",
            "name"=>"لهستان"],

        ["id" => "116",
            "name"=>"لوکزامبورگ"],

        ["id" => "267",
            "name"=>"ليبريا"],

        ["id" => "102",
            "name"=>"ليبي"],

        ["id" => "68",
            "name"=>"ليتواني"],

        ["id" => "268",
            "name"=>"ليختن اشتاين"],

        ["id" => "19",
            "name"=>"ماداگاسکار"],

        ["id" => "8013",
            "name"=>"مارتينيک"],

        ["id" => "191",
            "name"=>"مالاوي"],

        ["id" => "117",
            "name"=>"مالت"],

        ["id" => "270",
            "name"=>"مالديو"],

        ["id" => "15",
            "name"=>"مالزي"],

        ["id" => "190",
            "name"=>"مالي"],

        ["id" => "276",
            "name"=>"ماکائو"],

        ["id" => "118",
            "name"=>"مجارستان"],

        ["id" => "271",
            "name"=>"مراکش"],

        ["id" => "40",
            "name"=>"مصر"],

        ["id" => "272",
            "name"=>"مغولستان"],

        ["id" => "556",
            "name"=>"مقدونيه"],

        ["id" => "277",
            "name"=>"موريتاني"],

        ["id" => "195",
            "name"=>"موريس"],

        ["id" => "196",
            "name"=>"موزامبيک"],

        ["id" => "69",
            "name"=>"مولداوي"],

        ["id" => "119",
            "name"=>"موناکو"],

        ["id" => "8014",
            "name"=>"مونترات"],

        ["id" => "70",
            "name"=>"ميانمار(برمه)"],

        ["id" => "193",
            "name"=>"مکزيک"],

        ["id" => "213",
            "name"=>"نارو"],

        ["id" => "274",
            "name"=>"ناميبيا"],

        ["id" => "197",
            "name"=>"نپال"],

        ["id" => "120",
            "name"=>"نروژ"],

        ["id" => "198",
            "name"=>"نيجر"],

        ["id" => "199",
            "name"=>"نيجريه"],

        ["id" => "22",
            "name"=>"نيوزيلند"],

        ["id" => "200",
            "name"=>"نيکاراگوئه"],

        ["id" => "203",
            "name"=>"هائيتي"],

        ["id" => "419",
            "name"=>"هلند"],

        ["id" => "204",
            "name"=>"هندوراس"],

        ["id" => "42",
            "name"=>"هندوستان"],

        ["id" => "43",
            "name"=>"هنگ کنگ"],

        ["id" => "121",
            "name"=>"واتيکان"],

        ["id" => "215",
            "name"=>"وان واتو"],

        ["id" => "201",
            "name"=>"ونزوئلا"],

        ["id" => "202",
            "name"=>"ويتنام"],

        ["id" => "122",
            "name"=>"يمن"],

        ["id" => "44",
            "name"=>"يوگسلاوي"],

        ["id" => "28",
            "name"=>"يونان"],

        ["id" => "172",
            "name"=>"کاستاريکا"],

        ["id" => "173",
            "name"=>"کامبوج"],

        ["id" => "174",
            "name"=>"کامرون"],

        ["id" => "519",
            "name"=>"کانادا"],

        ["id" => "256",
            "name"=>"کاي من"],

        ["id" => "65",
            "name"=>"کپ ورد"],

        ["id" => "14",
            "name"=>"کره‌جنوبي"],

        ["id" => "212",
            "name"=>"کره‌شمالي"],

        ["id" => "282",
            "name"=>"کرواسي"],

        ["id" => "259",
            "name"=>"کريباتي"],

        ["id" => "11",
            "name"=>"کلمبيا"],

        ["id" => "8015",
            "name"=>"کنگو برازاويل"],

        ["id" => "8016",
            "name"=>"کنگو زئير"],

        ["id" => "175",
            "name"=>"کنگو کينشازا"],

        ["id" => "258",
            "name"=>"کنيا"],

        ["id" => "12",
            "name"=>"کوبا"],

        ["id" => "8011",
            "name"=>"کومور"],

        ["id" => "5",
            "name"=>"کويت"],
    ];
}
